# IsVerticallyCompound Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..IsVerticallyCompound Property
CompoundStructure Class See Also
---
Identifies if this CompoundStructure represents a layout that is more complicated than a simple set of parallel layers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsVerticallyCompound { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsVerticallyCompound As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsVerticallyCompound {
	bool get ();
}
```

# Remarks
Vertically compound structures should be assigned only to walls.
# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace